2026 Jan 02 11:48:55 leaf4 %SEC-6-LOGIN_SUCCESS: Login Success [user: admin] [Source: 10.10.10.50] [local-port: 22]

leaf4# show logging last 50
2026 Jan 02 11:45:11 leaf4 %ETHPORT-3-IF_ERROR: Interface Ethernet1/1, CRC error detected
2026 Jan 02 11:45:13 leaf4 %ETHPORT-3-IF_ERROR: Interface Ethernet1/1, CRC error detected
2026 Jan 02 11:45:16 leaf4 %ETHPORT-3-IF_ERROR: Interface Ethernet1/1, CRC threshold exceeded
2026 Jan 02 11:45:18 leaf4 %PM-4-ERRDISABLE: crc-error error detected on Ethernet1/1
2026 Jan 02 11:45:19 leaf4 %ETHPORT-5-IF_ADMIN_DOWN: Interface Ethernet1/1 is down (err-disable)
2026 Jan 02 11:45:23 leaf4 %OSPF-5-ADJCHG: OSPF-1 VRF default: Nbr 10.10.0.1 on Ethernet1/1 from FULL to DOWN
2026 Jan 02 11:45:26 leaf4 %BGP-5-ADJCHANGE: neighbor 10.10.0.1 l2vpn evpn Down - Interface down
2026 Jan 02 11:45:31 leaf4 %BGP-5-ADJCHANGE: neighbor 10.10.0.2 l2vpn evpn Up


leaf4# show ip ospf interface
Ethernet1/1 is down
  Internet Address 192.168.41.2/30, Area 0.0.0.0
  Adjacent neighbor count is 0

Ethernet1/2 is up, line protocol is up
  Internet Address 192.168.42.2/30, Area 0.0.0.0
  Process ID 1, Router ID 10.10.0.6, Network Type BROADCAST, Cost 10
  Transmit Delay is 1 sec, State DR, Priority 1
  Designated Router (ID) 10.10.0.6, Interface address 192.168.42.2
  Adjacent neighbor count is 1

leaf4# show interface Ethernet1/1
Ethernet1/1 is down (err-disabled)
  Hardware: Ethernet, address: 5e00.0004.0001
  MTU 9216 bytes, BW 10000000 Kbit
  12478 input errors, 12456 CRC, 0 frame, 0 overrun

leaf4# show interface Ethernet1/2
Ethernet1/2 is up
  Hardware: Ethernet, address: 5e00.0004.0002
  MTU 9216 bytes, BW 10000000 Kbit
  reliability 255/255, txload 1/255, rxload 1/255
  5 minute input rate 8700 bits/sec, 11 packets/sec
  5 minute output rate 8400 bits/sec, 10 packets/sec
  0 input errors, 0 CRC, 0 frame, 0 overrun

leaf4# show bgp neighbors 10.10.0.1
BGP neighbor is 10.10.0.1, remote AS 65000, internal link
  BGP version 4, remote router ID 10.10.0.1
  BGP state = Idle
  Last reset due to: Interface down

leaf4# show bgp neighbors 10.10.0.2
BGP neighbor is 10.10.0.2, remote AS 65000, internal link
  BGP version 4, remote router ID 10.10.0.2
  BGP state = Established, up for 2d04h
  Last reset due to: none

leaf4# show bgp l2vpn evpn neighbors 10.10.0.1
BGP neighbor is 10.10.0.1, remote AS 65000
  Address Family L2VPN EVPN:
    BGP state = Idle
    PfxRcd = 0

leaf4# show bgp l2vpn evpn neighbors 10.10.0.2
BGP neighbor is 10.10.0.2, remote AS 65000
  Address Family L2VPN EVPN:
    BGP state = Established
    PfxRcd = 8
