2026 Jan 02 11:45:06 leaf3 %SEC-6-LOGIN_SUCCESS: Login Success [user: admin] [Source: 10.10.10.50] [local-port: 22]

leaf3# show logging last 50
2026 Jan 02 11:42:11 leaf3 %BGP-5-ADJCHANGE: neighbor 10.10.0.2 l2vpn evpn Down - Hold Timer expired
2026 Jan 02 11:42:13 leaf3 %TCP-2-MPULLUP: bgp tcp m_pullup failed for connection, error No system resources
2026 Jan 02 11:42:17 leaf3 %BGP-5-ADJCHANGE: neighbor 10.10.0.2 l2vpn evpn Up
2026 Jan 02 11:42:26 leaf3 %BGP-5-ADJCHANGE: neighbor 10.10.0.2 l2vpn evpn Down - Active open failed
2026 Jan 02 11:42:33 leaf3 %BGP-5-ADJCHANGE: neighbor 10.10.0.1 l2vpn evpn Up


leaf3# show ip ospf interface
Ethernet1/1 is up, line protocol is up
  Internet Address 192.168.35.2/30, Area 0.0.0.0
  Process ID 1, Router ID 10.10.0.5, Network Type BROADCAST, Cost 10
  Transmit Delay is 1 sec, State DR, Priority 1
  Designated Router (ID) 10.10.0.5, Interface address 192.168.35.2
  Adjacent neighbor count is 1

Ethernet1/2 is up, line protocol is up
  Internet Address 192.168.36.2/30, Area 0.0.0.0
  Process ID 1, Router ID 10.10.0.5, Network Type BROADCAST, Cost 10
  Transmit Delay is 1 sec, State DR, Priority 1
  Designated Router (ID) 10.10.0.5, Interface address 192.168.36.2
  Adjacent neighbor count is 1

leaf3# show interface Ethernet1/1
Ethernet1/1 is up
  Hardware: Ethernet, address: 5e00.0003.0001
  MTU 9216 bytes, BW 10000000 Kbit
  reliability 255/255, txload 1/255, rxload 1/255
  0 input errors, 0 CRC, 0 frame, 0 overrun

leaf3# show interface Ethernet1/2
Ethernet1/2 is up
  Hardware: Ethernet, address: 5e00.0003.0002
  MTU 9216 bytes, BW 10000000 Kbit
  reliability 255/255, txload 1/255, rxload 1/255
  0 input errors, 0 CRC, 0 frame, 0 overrun

leaf3# show bgp neighbors 10.10.0.1
BGP neighbor is 10.10.0.1, remote AS 65000, internal link
  BGP version 4, remote router ID 10.10.0.1
  BGP state = Established, up for 2d02h
  Last reset due to: none

leaf3# show bgp neighbors 10.10.0.2
BGP neighbor is 10.10.0.2, remote AS 65000, internal link
  BGP version 4, remote router ID 10.10.0.2
  BGP state = Established, up for 2d02h
  Last reset due to: none

leaf3# show bgp l2vpn evpn neighbors 10.10.0.1
BGP neighbor is 10.10.0.1, remote AS 65000
  Address Family L2VPN EVPN:
    BGP state = Established
    PfxRcd = 18

leaf3# show bgp l2vpn evpn neighbors 10.10.0.2
BGP neighbor is 10.10.0.2, remote AS 65000
  Address Family L2VPN EVPN:
    BGP state = Idle
    PfxRcd = 0
